# FabricationRodInfo Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationRodInfo Class
Members See Also
---
The rod information of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public class FabricationRodInfo : IDisposable
```

Visual Basic
---
```text
Public Class FabricationRodInfo _
	Implements IDisposable
```

Visual C++
---
```text
public ref class FabricationRodInfo : IDisposable
```

# Remarks
A fabrication part may have one or more rods. The FabricationRodInfo stores the rod information of the fabrication part.
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FabricationRodInfo
# See Also
FabricationRodInfo Members
Autodesk.Revit.DB Namespace